src/cf/InformationRegisters/НоменклатурныеГруппыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>НоменклатурныеГруппыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСегментыНоменклатурныхГрупп</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НоменклатурныеГруппыСегмента/Ext/ManagerModule.bsl
// +++ VOG Кулаков П.Л. 26.07.2021 DEV-782
Функция ПолучитьМассивНоменклатурныхГруппСегмента(Сегмент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	НоменклатурныеГруппыСегмента.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	РегистрСведений.НоменклатурныеГруппыСегмента КАК НоменклатурныеГруппыСегмента
		|ГДЕ
		|	НоменклатурныеГруппыСегмента.Сегмент = &Сегмент";
	
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("НоменклатурнаяГруппа");
	
КонецФункции // --- VOG Кулаков П.Л.
